# Brewfile - Frozen 2026-02-06
# Use `brew bundle` to install all packages
# Use `brew bundle dump --force --describe` to update this file

tap "stripe/stripe-cli"

# ==============================================================================
# Core Tools & Utilities
# ==============================================================================
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Internet file retriever
brew "wget"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# General-purpose lossless data-compression library
brew "zlib"

# ==============================================================================
# Shell & Terminal
# ==============================================================================
# UNIX shell (command interpreter)
brew "zsh"
# Command-line fuzzy finder written in Go
brew "fzf"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Modern, maintained replacement for ls
brew "eza"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tracks most-used directories to make cd smarter
brew "z"
# Load/unload environment variables based on $PWD
brew "direnv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal multiplexer
brew "tmux"

# ==============================================================================
# Development Tools
# ==============================================================================
# Distributed revision control system
brew "git"
# GitHub command-line tool
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Tool for managing dock items
brew "dockutil"
# OpenTofu - open source infrastructure as code tool
brew "opentofu"

# ==============================================================================
# AI & LLM Tools
# ==============================================================================
# Get up and running with large language models
brew "ollama"
# LLM inference in C/C++
brew "llama.cpp"

# ==============================================================================
# Cloud & DevOps
# ==============================================================================
# Official Amazon AWS command-line interface
brew "awscli"
# Command-line tool for DigitalOcean
brew "doctl"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"

# ==============================================================================
# Media & Graphics
# ==============================================================================
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"

# ==============================================================================
# Network Tools
# ==============================================================================
# Port scanning utility for large networks
brew "nmap"

# ==============================================================================
# Development Applications
# ==============================================================================
# High-performance, multiplayer code editor
cask "zed"
# Open-source code editor
cask "visual-studio-code"
# Collaboration platform for API development
cask "postman"
# Replacement for Docker Desktop
cask "orbstack"
# Tools for building Android applications
cask "android-studio"

# ==============================================================================
# Fonts
# ==============================================================================
cask "font-meslo-lg-nerd-font"

# ==============================================================================
# Browsers
# ==============================================================================
# Web browser focusing on privacy
cask "brave-browser"
# Web browser
cask "google-chrome"

# ==============================================================================
# Communication
# ==============================================================================
# Team communication and collaboration software
cask "slack"
# Video communication and virtual meeting platform
cask "zoom"
# Screen and video recording software
cask "loom"

# ==============================================================================
# Productivity
# ==============================================================================
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# ==============================================================================
# Utilities
# ==============================================================================
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Adaptive brightness for external displays
cask "lunar"
# Window manager tool for moving and zooming windows
cask "moom"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"

# ==============================================================================
# Entertainment
# ==============================================================================
# Music streaming service
cask "spotify"
# Multimedia player
cask "vlc"
# Desktop client for the Pandora web radio service
cask "pandora"

# ==============================================================================
# VS Code Extensions
# ==============================================================================
vscode "charliermarsh.ruff"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "waderyan.gitblame"
