tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "humansignal/tap"
brew "grpc"
brew "python@3.12"
brew "apache-arrow"
brew "awscli"
brew "bat"
brew "gettext"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "doctl"
brew "duckdb"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libmicrohttpd"
brew "ffmpeg"
brew "fzf"
brew "gnupg"
brew "libpq"
brew "poppler"
brew "gdal"
brew "git"
brew "htop"
brew "hub"
brew "nmap"
brew "btop"
brew "node"
brew "pipx"
brew "postgresql@16"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"
brew "z"
brew "zlib"
brew "zsh"
brew "ollama"
cask "brave-browser"
cask "cyberduck", args: { appdir: "/Applications" }
cask "expressvpn"
cask "iterm2", args: { appdir: "/Applications" }
cask "menubar-stats", args: { appdir: "/Applications" }
cask "ngrok", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "orbstack"
cask "pandora", args: { appdir: "/Applications" }
cask "postico", args: { appdir: "/Applications" }
cask "postman"
cask "session-manager-plugin"
cask "sketch", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "sublime-text"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "bastienboutonnet.vscode-dbt"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "fallenmax.mithril-emmet"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "henriblancke.vscode-dbt-formatter"
vscode "innoverio.vscode-dbt-power-user"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
