tap "homebrew/bundle"
tap "homebrew/services"
tap "humansignal/tap"
brew "xz"
brew "openssl@3"
brew "grpc"
brew "python@3.12"
brew "asitop"
brew "awscli"
brew "bat"
brew "gettext"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "doctl"
brew "duckdb"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libmicrohttpd"
brew "ffmpeg"
brew "fzf"
brew "gnupg"
brew "gpgme"
brew "libpq", link: true
brew "poppler"
brew "git"
brew "huggingface-cli"
brew "llama.cpp"
brew "mactop"
brew "nmap"
brew "node"
brew "pandoc"
brew "pipx"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"
brew "z"
brew "zlib"
brew "zsh"
cask "brave-browser", args: { appdir: "/Applications" }
cask "cyberduck", args: { appdir: "/Applications" }
cask "expressvpn", args: { appdir: "/Applications" }
cask "lunar", args: { appdir: "/Applications" }
cask "medis", args: { appdir: "/Applications" }
cask "ngrok", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "orbstack", args: { appdir: "/Applications" }
cask "pandora", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "bastienboutonnet.vscode-dbt"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "fallenmax.mithril-emmet"
vscode "github.github-vscode-theme"
vscode "henriblancke.vscode-dbt-formatter"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
